{
  "players": [
      {
        "id": "01",
        "url": "http://www.raketherake.com/poker-players/chris-ferguson",
        "name": "Chris Ferguson",
        "biography":"<p>Chris Ferguson began playing online poker on an IRC channel (quickly becoming the highest-ranked tournament player) long before any of the top poker sites of today even existed. At this early stage he recognised that his knowledge of game theory would give him a serious edge over other players, and started competing in small tourneys in and near LA.<br /> <br /> Graduating in 1999 from UCLA with a PhD in Computer Science, Chris Ferguson very quickly went on to win the 2000 World Series of Poker Main Event; defeating TJ Cloutier to take $1.5 million. This big win marked the real beginning of Ferguson's pro career.<br /> <br /> Since Chris started playing in the World Series, he has made more final tables (25), won more bracelets (5), and had more money finishes (42) than any other player. His WSOP winnings alone total over $4 million!<br /> <br /> More recently, Chris Ferguson put together a team of players and programmers to design the software for Full Tilt, but the site currently offers no games due to the revocation of its operating license.<br /> <br /> <em>Interesting fact: Chris Ferguson can cut a carrot in half from 10 feet away with a standard playing card.</em><br /> <br /> </p>",
        "nickName": "Jesus",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/chris-ferguson.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/chris-ferguson-marker.jpg",
        "homeTown": "Los Angeles, California",
        "fact1": "6",
        "fact2": "2",
        "fact3": "",
        "fact4": "",
        "fact5": "",
        "fact6": "",
        "twitterScreenName": ""
      },
      {
        "id": "02",
        "url": "http://www.raketherake.com/poker-players/annie-duke",
        "name": "Annie Duke",
        "biography":"<p>Born Anne LaBarr Lederer, Annie Duke is the daughter of two teachers - Rhoda S. and Richard Lederer. Annie thought she would become a teacher like her parents, but in the midst of research for her doctorate in Cognitive Psychology at the University of Pennsylvania, she proposed to long-standing friend Ben Duke. Annie subsequently abandoned her studies for a life of romantic poverty in Billings, Montana with Ben Duke, and began playing poker in the local rooms to pay the mortgage on their first home.<br /> <br /> Annie Duke won her first World Series of Poker bracelet in 2004, beating 234 players in the $2,000 buy-in Omaha Hi/Lo Split. In the same year she took $2 million in the invitation only, winner-takes-all No Limit Texas Hold'em WSOP Tournament of Champions.<br /> <br /> In 2005, Duke released her biography &quot;Annie Duke: How I raised, bluffed, flirted, cursed and won millions at the World Series of Poker.&quot; She has also released a series of poker DVDs. Annie currently works as a consultant for online poker site UB.com, and is highly sought after for her poker knowledge and skills, having coached the likes of Matt Damon and Ben Affleck.<br /> <br /> <em>Interesting Fact: Annie Duke is the sister of poker pro Howard Lederer. It was Howard who advised Duke to enter the 2004 WSOP, and she ended up knocking him out of the tournament.</em><br /> <br /> </p>",
        "nickName": "Annie Legend, The Duke, The Duchess",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/annie-duke.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/annie-duke-marker.jpg",
        "homeTown": "Toronto, Canada",
        "fact1": "1",
        "fact2": "38",
        "fact3": "10th, 2000",
        "fact4": "4",
        "fact5": "",
        "fact6": "",
        "twitterScreenName": "@AnnieDuke"
      },
      {
        "id": "03",
        "url": "http://www.raketherake.com/poker-players/patrik-antonius",
        "name": "Patrik Antonius",
        "biography":"<p>Patrik Antonius is one of the most recognisable characters in poker today with an unquestionable amount of skill and an aggressive playing style. Antonius played poker with friends on a casual basis for years, but when he started playing online he very soon became determined to drastically and quickly improve his game. Mentored by Marcel Lϋske and Jennifer Harman, 2005 saw Antonius start to make a name for himself in poker after finishing twelfth at the World Poker Stars Caribbean Adventure, fifteenth in the Bay 101 Shooting Stars event, and successfully participating in several WSOP events.<br /> <br /> Patrik Antonius is heads-up specialist, and plays regular online high-stakes games - from which he has won millions of dollars. In November 2009 Patrik Antonius won the biggest pot in online poker history - a whopping $1,356,946 - against Viktor Blom, who was at that time only known by his moniker 'Isildur1'. In addition to this unique achievement, Patrik Antonius can boast over $3 million in career tournament winnings.<br /> <br /> Born in Helsinki, Finnish Antonius now resides in Monte Carlo with his two children and his wife Maya Geller. Before his pro poker career, Patrik was a tennis player and coach, and a model.<br /> <br /> <em>Interesting fact: Antonius was the first player to go up against Tom Dwan in Dwan's 'Million Dollar Challenge'. The challenge entails a 50,000 hands heads-up, but neither players have managed to clear enough time in their schedules to complete the challenge as yet!</em><br /> <br /> </p>",
        "nickName": "PA, Black Lotus, The Finn",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/patrik-antonius.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/patrik-antonius-marker.jpg",
        "homeTown": "Helsinki, Finland",
        "fact1": "14",
        "fact2": "601st, 2010",
        "fact3": "1",
        "fact4": "7",
        "fact5": "",
        "fact6": "",
        "twitterScreenName": "@Patrik_Antonius"
      },     
      {
        "id": "04",
        "url": "http://www.raketherake.com/poker-players/david-benyamine",
        "name": "David Benyamine",
        "biography":"<p>Before his poker career, David Benyamine was a professional tennis player, but was forced to retire due to shoulder pain. Benyamine was by no means a late starter in poker though, learning the game at the age of 12 and playing regularly in high-stakes cash games. He has reportedly never read a single book on poker, meaning he is thought of as a naturally gifted player, learning solely from real experience.<br /> <br /> Hailing from Paris, France - where he was also a successful, top-ten ranking Billiards player - Benyamine now lives in Henderson, Nevada. He is married to fellow professional poker player Erica Schoenberg, with whom he has a child.<br /> <br /> Benyamine won the Grand Prix Paris, banking an impressive €357, 800. This significant success is cited as the big push in his career, and he has since gone on to make over $3 million from poker alone.<br /> <br /> <em>Interesting fact: David Benyamine was unfortunate enough to have the same or a similar name to someone on the USA's terrorist 'watch list', but was only deported from the States for not having a work permit.</em><br /> <br /> </p>",
        "nickName": "Napoleon, Degenyamine",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/david-benyamine.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/david-benyamine-marker.jpg",
        "homeTown": "Paris, France",
        "fact1": "1",
        "fact2": "10",
        "fact3": "58th 2010",
        "fact4": "1",
        "fact5": "4",
        "fact6": "11",
        "twitterScreenName": "@David_Benyamine"
      },
      {
        "id": "05",
        "url": "http://www.raketherake.com/poker-players/daniel-negreanu",
        "name": "Daniel Negreanu",
        "biography":"<p>At the age of just 23, Daniel Negreanu became the youngest person ever to win a gold bracelet, taking $169,460 in the $2,000 Pot Limit Texas Hold'em tournament. Negreanu finished 2nd in the World Series in 2002 before he went on to take his second bracelet in 2003, winning the SHOE event and bagging himself $100,440. His consistent performance means he has one of the best WSOP records of any player and has won more money than anyone else on the World Poker Tour.<br /> <br /> Negreanu works tirelessly to promote poker globally, and due to his level of expertise and strong opinions is often consulted by administrators. He also appears as a commentator and summarizer in the poker media; mentors other poker players; and has released the poker strategy book <em>Power Hold'em Strategy</em>, as well as having written over 100 articles for CardPlayer Magazine.<br /> <br /> Negreanu is a member of team PokerStars and he plays online poker exclusively at PokerStars.com under the name 'KidPoker'. When not playing or otherwise giving his time to poker, he likes to play pool, improve his golf game, and play video games.<br /> <br /> <em>Interesting fact: Daniel Negreanu has appeared as himself in the film 'Lucky You'; as a poker player in 'The Grand'; and made a cameo appearance playing poker against the character Gambit in 'X-Men Origins: Wolverine'.</em><br /> <br /> </p>",
        "nickName": "Kid Poker",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/daniel-negreanu.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/daniel-negreanu-marker.jpg",
        "homeTown": "Toronto, Canada",
        "fact1": "4",
        "fact2": "26",
        "fact3": "11th, 2001",
        "fact4": "2",
        "fact5": "8",
        "fact6": "18",
        "twitterScreenName": "@RealKidPoker"
      },
      {
        "id": "06",
        "url": "http://www.raketherake.com/poker-players/liz-lieu",
        "name": "Liz Lieu",
        "biography":"<p>Liz Lieu started playing poker when she was just thirteen years old, competing in Chinese Poker games with her friends, and going on to organise her own home games at the age of eighteen.<br /> <br /> After her father suffered a heart attack, Liz told both her parents to quit their jobs, and she determined to provide for them by making a living playing poker. Lieu took a substantial bankroll to Las Vegas to become a pro, but soon after moving up in limits she hit some problems in her personal life that nearly left her broke. With the help and encouragement of fellow poker pro and best friend John Phan, Liz Lieu rebuilt her bankroll and was soon back on form. It was John Phan who encouraged Liz to enter the 2005 World Series of Poker, where she ended up finishing fifth in the $1500 no limit hold'em event, taking nearly $170,000 in prize money.<br /> <br /> Lieu went on to compete in more tournaments and play poker all over the world, but she has also worked with numerous local and global non-profit organizations such as 'Women In Need' and 'The National Multiple Sclerosis Society'. She has also donated 20% of her earnings to charity since 2005.<br /> <br /> As of 2010, Liz Lieu had earned over $825,000 from live tournament poker. <br /> <br /> <em>Interesting Fact: Liz Lieu appeared in the 2009 Hong Kong comedy film 'Poker King' as herself.</em><br /> <br /> </p>",
        "nickName": "Poker Diva",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/liz-lieu.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/liz-lieu-marker.jpg",
        "homeTown": "Los Angeles, California",
        "fact1": "6",
        "fact2": "2",
        "fact3": "",
        "fact4": "",
        "fact5": "",
        "fact6": "",
        "twitterScreenName": "@LizLieu"
        },
        {
        "id": "07",
        "url": "http://www.raketherake.com/poker-players/john-juanda",
        "name": "John Juanda",
        "biography":"<p>Johnson 'John' Juanda, born in Medan, Indonesia arrived in the US in 1990 to enrol at Oklahoma State University. He went on to earn an MBA from Seattle University.<br /> <br /> Juanda was named CardPlayer magazine's tournament player of the year in both 2001 and 2002, having won a World Poker Open Championship title and four World Series of Poker titles. In 2005 he won the Monte Carlo Millions, walking away with a total prize of nearly $500,000. The following year, Juanda took first place and A$1 million at the Crown Australian Poker Championship speed poker event. <br /> <br /> John earned his 5th WSOP bracelet in 2011 in the $10,000 Lowball World Championship, beating Phil Hellmuth in one of the toughest fields ever assembled for a World Series of Poker event. The contest took over 3 hours to be decided before John Juanda walked away with the $367,000 first prize.<br /> <br /> <em>Interesting fact: John Juanda had a stint as a door-to-door salesman selling Bibles before becoming a pro poker player.</em><br /> <br /> </p>",
        "nickName": "JJ Luckbox",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/john-juanda.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/john-juanda-marker.jpg",
        "homeTown": "Seattle, Washington",
        "fact1": "5",
        "fact2": "30",
        "fact3": "31 st, 2005",
        "fact4": "6",
        "fact5": "19",
        "fact6": "",
        "twitterScreenName": "@LuckBoxJuanda"
        },
        {
        "id": "08",
        "url": "http://www.raketherake.com/poker-players/jamie-gold",
        "name": "Jamie Gold",
        "biography":"<p>Jamie Gold won the World Series of Poker in 2006 to take away an unbelievable $12 million - the largest prize in the history of all sporting events. As such, Gold ranks 1st on the WSOP's all-time money list.<br /> <br /> Jamie learnt to play poker with his mother and grandfather in their competitive family home; his mother was an accomplished poker player, and his grandfather a gin rummy champion. Once he'd graduated with a BA from the University of New York at Albany, and studied Entertainment Law at UCLA, Gold very quickly went on to find work as a talent agent with several high profile agencies. He is credited with developing the careers of stars such as Lucy Liu (Charlie's Angels), James Gandolfini (The Sopranos), and Kristin Davies (Sex and the City). More recently Jamie Gold has worked as a Television Producer.<br /> <br /> Jamie Gold entered the 2006 WSOP Main Event as a member of Bodog.com's celebrity team, and proved to be an unstoppable force, leaving his fellow celebrities eating his dust as he rapidly made it to the final table. In the last four days of the main event, Gold beat several much more seasoned players to take first place, and became something of an overnight World Champion. <br /> <br /> <em>Interesting fact: Jamie Gold is known for eating blueberries at the poker table.</em><br /> <br /> </p>",
        "nickName": "The Poker Philanthropist",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/jamie-gold.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/jamie-gold-marker.jpg",
        "homeTown": "Abuja, Nigeria",
        "fact1": "5",
        "fact2": "30",
        "fact3": "31 st, 2005",
        "fact4": "6",
        "fact5": "19",
        "fact6": "",
        "twitterScreenName": "@RealJamieGold"
        },
        {
        "id": "09",
        "url": "http://www.raketherake.com/poker-players/mike-matusow",
        "name": "Mike Matusow",
        "biography":"<p>Mike Matusow started playing poker seriously in the early 90s, initially while working as a poker dealer, and then as professional player. His earliest experiences of poker came at age 18, when he would play video poker compulsively in the Maxim Casino. Matusow played video poker so regularly that he suffered a repetitive strain injury in his shoulders and arms. During this time, he occasionally stole money from his mother's purse, and subsequently attended some Gamblers Anonymous meetings.<br /> <br /> In 1997, Mike entered his first WSOP tournament and finished second to Scotty Nguyen. Then in 1999 Matusow won his first WSOP bracelet playing the $3,500 buy-in No Limit Hold'em tourney. He went on to finish 6th in the WSOP main event in 2001, and went on to win his second WSOP bracelet the following year in the £5,000 buy-in Omaha8/Better tourney.<br /> <br /> Mike celebrated his success hard, and so much so that his personal and professional life hit a very rough patch. In 2004 he was sentenced to 6 months in jail on a drugs charge.<br /> <br /> Mike Matusow has earned the nickname 'The Mouth' through his reputation for trash-talking at the tables. 'Mike Matusow blow-up' and 'Mike Matusow meltdown' have become somewhat popular terms, describing his terrible moments of misjudgement whereby he can ruin hours or even days of play in one fell swoop. <br /> <br /> <em>Interesting fact: In 2007 Mike Matusow made a $100,000 bet with fellow pro Ted Forrest that Mike could lose enough weight to get down to 181 pounds by June 2008. Mike won the bet, weighing in at 179 pounds.</em><br /> <br /> </p>",
        "nickName": "The Mouth",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/mike-matusow.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/mike-matusow-marker.jpg",
        "homeTown": "Riyadh, Saudi Arabia",
        "fact1": "5",
        "fact2": "30",
        "fact3": "31 st, 2005",
        "fact4": "6",
        "fact5": "19",
        "fact6": "",
        "twitterScreenName": "@themouthmatusow"
        },
        {
        "id": "10",
        "url": "http://www.raketherake.com/poker-players/greg-raymer",
        "name": "Greg Raymer",
        "biography":"<p>Greg Raymer is perhaps most well-known for winning the 2004 World Series of Poker Main Event. Raymer himself has said that this significant win opened up all sorts of endorsement and casino appearance opportunities for him.<br /> <br /> Greg Raymer's journey to poker started out while he was still in school in Minnesota, where he made extra money by playing blackjack as a card counter at the state's various Indian casinos. When he took his first job in Chicago, there were no readily beatable blackjack games that Raymer could play, and while looking for a blackjack game he instead found poker. Raymer believes that the book 'The Theory of Poker' by David Sklansky helped him a great deal in laying the groundwork for all his future poker education.<br /> <br /> Greg Raymer has tried his hand at radio and party DJ-ing, and stand-up comedy (but confesses that he was not very funny). He is a full-time representative for PokerStars.com. When not giving his attention to poker, Greg likes to spend time with his family, play golf, and visit estate auctions to buy antiques for his family home.<br /> <br /> <em>Interesting fact: At Greg Ramyer's website - www.fossilmanpoker.com - you can purchase his trademark Lizard-Eye sunglasses, and actual 'Fossil Man' autographed fossils!</em><br /> <br /> </p>",
        "nickName": "Fossilman",
        "image": "http://www.raketherake.com/assets/rtr/images/pro-profiles/greg-raymer.jpg",
        "imageThumbnail": "http://www.raketherake.com/assets/rtr/images/pro-profiles/greg-raymer-marker.jpg",
        "homeTown": "Sibiu Romania",
        "fact1": "5",
        "fact2": "30",
        "fact3": "31 st, 2005",
        "fact4": "6",
        "fact5": "19",
        "fact6": "",
        "twitterScreenName": "@Fossilman"
        }

    ]
}
